DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool httpServerStarted = false;
bool rawOtaServerStarted = false;
bool setupMode = false;
bool waitStatusRendered = false;
String lastConnectedSetupIp;
bool otaUploadSucceeded = false;
bool otaUploadInProgress = false;
bool otaUploadNeedsReboot = false;
String otaUploadError;
bool assetUploadSucceeded = false;
bool assetUploadInProgress = false;
String assetUploadError;
String assetUploadPath;
size_t assetUploadBytesSeen = 0;
File assetUploadFile;
String activeThemeSpecPath;
String activeThemeSpecHash;
standby::State standbyState;
// Captured when standby takes the screen, so the way back is the theme that was
// really drawn. There is no second resident ThemeSpec slot: both directions
// reload from LittleFS, which #277 measured at 250-420 ms.
String standbyLiveThemePath;
codexbar_display::esp8266::wifi_setup::State setupWifiState;
bool rebootPending = false;
unsigned long rebootAtMs = 0;
unsigned long lastFrameAcceptedAtMs = 0;
bool pendingHttpRender = false;
codexbar_display::core::SerialConsumeEvent pendingHttpRenderEvent;
bool frameStaleStatusRendered = false;
bool captiveDnsStarted = false;
unsigned long wifiDisconnectedAtMs = 0;
unsigned long wifiReconnectAttemptAtMs = 0;
bool wifiReconnectStatusRendered = false;
FirmwareUpdateState firmwareUpdate;
bool firmwareUpdateNoticeDirty = false;
OtaUploadDiagnostics otaDiagnostics;
RuntimeRenderDiagnostics renderDiagnostics;
DeviceSettings deviceSettings;
String deviceAuthToken;
String bootID;
String bootResetReasonJSON;
uint32_t bootResetCounter = 0;

void addCorsHeaders();

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
constexpr const char* kLegacyMiniThemeSpecPath = "/themes/u/mini-cl-1-410a37.json";
#endif

void recordRenderFull(const char* kind, unsigned long durationUs) {
  renderDiagnostics.fullCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastFullKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordRenderPartial(const char* kind, unsigned long durationUs) {
  renderDiagnostics.partialCount++;
  renderDiagnostics.lastKind = kind;
  renderDiagnostics.lastPartialKind = kind;
  renderDiagnostics.lastDurationUs = durationUs;
  renderDiagnostics.lastAtMs = millis();
}

void recordAnimatedTickAttempt() {
  renderDiagnostics.animatedTickAttempts++;
}

String jsonEscape(const String& raw) {
  String escaped;
  escaped.reserve(raw.length() + 8);
  for (size_t i = 0; i < raw.length(); ++i) {
    const char c = raw.charAt(i);
    switch (c) {
      case '\\':
        escaped += "\\\\";
        break;
      case '"':
        escaped += "\\\"";
        break;
      case '\n':
        escaped += "\\n";
        break;
      case '\r':
        escaped += "\\r";
        break;
      case '\t':
        escaped += "\\t";
        break;
      default:
        escaped += c;
        break;
    }
  }
  return escaped;
}

uint32_t fnv1a32(const String& raw) {
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < raw.length(); ++i) {
    hash ^= static_cast<uint8_t>(raw[i]);
    hash *= 16777619UL;
  }
  return hash;
}

String hashHex8(const String& raw) {
  String out = String(fnv1a32(raw), HEX);
  while (out.length() < 8) {
    out = "0" + out;
  }
  return out;
}

void appendJSONNullableString(String& out, const String& value) {
  if (value.length() == 0) {
    out += "null";
    return;
  }
  out += "\"";
  out += jsonEscape(value);
  out += "\"";
}

uint8_t clampBrightnessPercent(int value) {
  return codexbar_display::esp8266::device_settings::ClampBrightnessPercent(value);
}

// Single place that decides how bright the panel is, so entering standby,
// waking up and editing either brightness value all go through one path.
void applyDeviceSettings() {
  if (renderer.SupportsBrightnessControl()) {
    renderer.ApplyBrightnessPercent(standbyState.active
                                        ? deviceSettings.standby.brightnessPercent
                                        : deviceSettings.brightnessPercent);
  }
}

bool loadDeviceSettings() {
  deviceSettings = DeviceSettings{};
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceSettingsPath)) {
    applyDeviceSettings();
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "r");
  if (!file) {
    applyDeviceSettings();
    return false;
  }
  uint8_t record[kDeviceSettingsRecordBytes] = {};
  const int readBytes = file.read(record, sizeof(record));
  file.close();
  const int brightness = readBytes >= 1 ? record[0] : -1;
  deviceSettings.brightnessPercent =
      codexbar_display::esp8266::device_settings::BrightnessFromPersistedByte(brightness);
  // Records written before the device clock existed only hold the brightness
  // byte; the clock then simply relearns the offset from the next frame.
  int offsetMinutes = 0;
  if (readBytes >= 1 &&
      deviceclock::DecodeUtcOffset(record + 1, static_cast<size_t>(readBytes) - 1, offsetMinutes)) {
    deviceclock::RestoreUtcOffset(runtimeCtx.clock, offsetMinutes);
  }
  // Records written before standby existed stop here, which leaves the standby
  // factory defaults in place.
  if (readBytes > static_cast<int>(kStandbyRecordOffset)) {
    standby::Decode(record + kStandbyRecordOffset,
                    static_cast<size_t>(readBytes) - kStandbyRecordOffset,
                    deviceSettings.standby);
  }
  applyDeviceSettings();
  return brightness > 0;
}

bool saveDeviceSettings() {
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceSettingsPath, "w");
  if (!file) {
    return false;
  }
  uint8_t record[kDeviceSettingsRecordBytes] = {};
  record[0] = deviceSettings.brightnessPercent;
  deviceclock::EncodeUtcOffset(runtimeCtx.clock, record + 1);
  standby::Encode(deviceSettings.standby, record + kStandbyRecordOffset);
  const size_t written = file.write(record, sizeof(record));
  file.close();
  return written > 0;
}

// Reset-deadline handover across a self-initiated restart.
//
// Written only in the moment the firmware decides to reboot, and consumed once
// on the next boot. That is two LittleFS writes per deliberate restart and none
// per frame, so a ticking countdown never touches flash.
//
// Without a wall clock the device cannot measure how long it was powerless, so
// the record is only honoured after a software restart, where the gap is the
// firmware's own boot. Any other reset reason drops it.
void persistResetTrustForRestart() {
  if (!LittleFS.begin()) {
    return;
  }
  const String record = codexbar_display::core::EncodeResetTrustRecord(runtimeCtx.runtime.reset, millis());
  if (record.length() == 0) {
    LittleFS.remove(kResetTrustHandoverPath);
    return;
  }
  File file = LittleFS.open(kResetTrustHandoverPath, "w");
  if (!file) {
    return;
  }
  file.print(record);
  file.close();
}

