DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  out += "\"clock\":{\"synced\":";
  out += runtimeCtx.clock.synced ? "true" : "false";
  out += ",\"source\":\"";
  out += deviceclock::SourceName(source);
  out += "\",\"epoch\":";
  out += String(static_cast<long>(deviceclock::UtcNow(runtimeCtx.clock, nowMs)));
  out += ",\"utcOffsetMinutes\":";
  if (runtimeCtx.clock.hasUtcOffset) {
    out += String(static_cast<int>(runtimeCtx.clock.utcOffsetMinutes));
  } else {
    out += "null";
  }
  out += ",\"lastSyncAgeMs\":";
  if (runtimeCtx.clock.synced) {
    out += String(nowMs - runtimeCtx.clock.syncMillis);
  } else {
    out += "null";
  }
  out += ",\"syncCount\":";
  out += String(runtimeCtx.clock.syncCount);
  out += ",\"time\":\"";
  out += timeText;
  out += "\",\"date\":\"";
  out += dateText;
  out += "\"},";
}

void markFirmwareUpdateNoticeDirty() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    return;
  }
  if (!codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec) {
    return;
  }
  if (!runtimeCtx.screenDirty && !waitStatusRendered && !frameStaleStatusRendered) {
    firmwareUpdateNoticeDirty = true;
  } else {
    runtimeCtx.screenDirty = true;
  }
}

bool shouldShowFirmwareUpdateNotice() {
  return firmwareUpdate.noticeEnabled &&
         firmwareUpdate.notice.visible &&
         !setupMode &&
         !waitStatusRendered &&
         !frameStaleStatusRendered &&
         codexbar_display::app::HasFrame(runtimeCtx) &&
         codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec &&
         !codexbar_display::app::CurrentFrame(runtimeCtx).hasError;
}

const char* currentFirmwareUpdateNoticeText() {
  switch (codexbar_display::updatenotice::CurrentPhase(firmwareUpdate.notice)) {
    case codexbar_display::updatenotice::Phase::Available:
      return kFirmwareUpdateAvailableText;
    case codexbar_display::updatenotice::Phase::MacApp:
      return kFirmwareUpdateMacAppText;
    case codexbar_display::updatenotice::Phase::Provider:
      break;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (runtimeCtx.topLineOverride.length()) {
    return runtimeCtx.topLineOverride.c_str();
  }
  if (frame.label.length()) {
    return frame.label.c_str();
  }
  if (frame.provider.length()) {
    return frame.provider.c_str();
  }
  return "Provider";
}

void drawFirmwareUpdateNotice() {
  if (!shouldShowFirmwareUpdateNotice()) {
    firmwareUpdateNoticeDirty = false;
    return;
  }
  renderer.DrawFirmwareUpdateNotice(runtimeCtx, currentFirmwareUpdateNoticeText());
  firmwareUpdateNoticeDirty = false;
}

void restoreFirmwareUpdateNoticeSurface() {
  if (!codexbar_display::app::HasFrame(runtimeCtx) ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError ||
      waitStatusRendered ||
      frameStaleStatusRendered) {
    return;
  }
  if (!renderer.ClearFirmwareUpdateNoticeSurface(runtimeCtx)) {
    runtimeCtx.screenDirty = true;
  }
}

void clearFirmwareUpdateNotice() {
  const codexbar_display::updatenotice::TickResult result =
      codexbar_display::updatenotice::Deactivate(firmwareUpdate.notice);
  firmwareUpdateNoticeDirty = false;
  if (result.restore) {
    restoreFirmwareUpdateNoticeSurface();
  }
}

void maintainFirmwareUpdateNotice() {
  if (!firmwareUpdate.noticeEnabled ||
      setupMode ||
      frameStaleStatusRendered ||
      !codexbar_display::app::HasFrame(runtimeCtx) ||
      !codexbar_display::app::CurrentFrame(runtimeCtx).hasThemeSpec ||
      codexbar_display::app::CurrentFrame(runtimeCtx).hasError) {
    clearFirmwareUpdateNotice();
    return;
  }

  const unsigned long nowMs = millis();
  // Surface detection walks the ThemeSpec, so re-check it at most once per
  // second: once to activate the notice, afterwards to follow theme changes.
  if (firmwareUpdate.noticeSurfaceCheckedAtMs == 0 ||
      (nowMs - firmwareUpdate.noticeSurfaceCheckedAtMs) >= kFirmwareUpdateSurfaceRecheckMs) {
    firmwareUpdate.noticeSurfaceCheckedAtMs = nowMs == 0 ? 1 : nowMs;
    const codexbar_display::updatenotice::TickResult activated =
        codexbar_display::updatenotice::Activate(
            firmwareUpdate.notice, renderer.FirmwareUpdateNoticeSurface(runtimeCtx), nowMs);
    if (activated.restore) {
      restoreFirmwareUpdateNoticeSurface();
    }
    if (activated.draw) {
      markFirmwareUpdateNoticeDirty();
    }
  }

  codexbar_display::updatenotice::Config config;
  config.phaseToggleMs = kFirmwareUpdateNoticeToggleMs;
  config.overlayVisibleMs = kFirmwareUpdateOverlayVisibleMs;
  config.overlayHiddenMs = kFirmwareUpdateOverlayHiddenMs;
  const codexbar_display::updatenotice::TickResult ticked =
      codexbar_display::updatenotice::Tick(firmwareUpdate.notice, config, nowMs);
  if (ticked.restore) {
    restoreFirmwareUpdateNoticeSurface();
  }
  if (ticked.draw) {
    markFirmwareUpdateNoticeDirty();
  }
}

void applyFrameUpdateState() {
  if (!codexbar_display::app::HasFrame(runtimeCtx)) {
    return;
  }

  const codexbar_display::core::Frame& frame = codexbar_display::app::CurrentFrame(runtimeCtx);
  if (!frame.hasUpdateAvailable) {
    firmwareUpdate.noticeEnabled = false;
    clearFirmwareUpdateNotice();
    return;
  }

  String nextStatus = frame.updateStatus;
  if (nextStatus.length() == 0) {
    nextStatus = frame.updateAvailable ? "update_available" : "current";
  }
  const bool changed = firmwareUpdate.available != frame.updateAvailable ||
                       firmwareUpdate.latestVersion != frame.updateLatestVersion ||
                       firmwareUpdate.lastStatus != nextStatus ||
                       firmwareUpdate.lastError != frame.updateLastError;
  firmwareUpdate.available = frame.updateAvailable;
  firmwareUpdate.latestVersion = frame.updateLatestVersion;
  firmwareUpdate.lastError = frame.updateLastError;
  firmwareUpdate.lastCheckedAtMs = millis();
  firmwareUpdate.nextCheckAtMs = 0;
  firmwareUpdate.lastStatus = nextStatus;

  if (!firmwareUpdate.available) {
    firmwareUpdate.noticeEnabled = false;
    clearFirmwareUpdateNotice();
    return;
  }
  if (changed) {
    // Restart the notice cycle for a new update state; the next maintain pass
    // re-activates it on the current theme's surface.
    clearFirmwareUpdateNotice();
    firmwareUpdate.noticeSurfaceCheckedAtMs = 0;
  }
  firmwareUpdate.noticeEnabled = true;
}

void drawWaitingForCompanionStatus() {
  String stationIp = WiFi.localIP().toString();
  if (WiFi.status() != WL_CONNECTED ||
      !codexbar_display::esp8266::ConnectedSetupPolicy::IsStationIPv4(stationIp.c_str())) {
    stationIp = "";
  }
  const unsigned long renderStartUs = micros();
  renderer.DrawConnectedSetupInstructions(runtimeCtx, kCustomerAppHost, stationIp);
  recordRenderFull("connected_setup", micros() - renderStartUs);
  lastConnectedSetupIp = stationIp;
  waitStatusRendered = true;
}

void drawWifiConnectingStatus(const String& ssid) {
  const unsigned long renderStartUs = micros();
  renderer.DrawStatus(runtimeCtx, "VIBE TV", "Connecting WiFi", ssid);
  recordRenderFull("status", micros() - renderStartUs);
}

