DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool assetPathLooksGif(const String& path);

void discardPartialAssetUpload() {
  if (!LittleFS.begin() || !LittleFS.exists(kAssetUploadTemporaryPath)) {
    return;
  }
  if (LittleFS.remove(kAssetUploadTemporaryPath)) {
    Serial.printf("asset_upload_discarded path=%s\n", assetUploadPath.c_str());
  }
}

bool validateCompletedAssetUpload() {
  if (!assetPathLooksGif(assetUploadPath)) {
    return true;
  }
  codexbar_display::esp8266::GifValidationInfo info;
  const codexbar_display::esp8266::GifValidationError error =
      codexbar_display::esp8266::ValidateGifAssetFile(
          kAssetUploadTemporaryPath,
          codexbar_display::esp8266::kMaxThemeGifLzwBits,
          &info);
  if (error == codexbar_display::esp8266::GifValidationError::None) {
    return true;
  }
  setAssetUploadError(
      error == codexbar_display::esp8266::GifValidationError::LzwCodeSizeExceeded
          ? "gif requires unsupported LZW width"
          : "invalid gif");
  return false;
}

bool promoteCompletedAssetUpload() {
  // LittleFS rename is atomic and replaces an existing destination only after
  // the temporary file has been fully written and, for GIFs, validated.
  if (!LittleFS.rename(kAssetUploadTemporaryPath, assetUploadPath)) {
    setAssetUploadError("commit asset failed");
    return false;
  }
  return true;
}

String requestedAssetPath() {
  String path = webServer.arg("path");
  path.trim();
  if (path.length() == 0) {
    path = webServer.upload().filename;
    path.trim();
    const int lastSlash = path.lastIndexOf('/');
    if (lastSlash >= 0) {
      path = path.substring(lastSlash + 1);
    }
    const int lastBackslash = path.lastIndexOf('\\');
    if (lastBackslash >= 0) {
      path = path.substring(lastBackslash + 1);
    }
    if (path.length() > 0 && !path.startsWith("/")) {
      path = "/" + path;
    }
  }
  return path;
}

bool assetPathLooksGif(const String& path) {
  String lower = path;
  lower.toLowerCase();
  return lower.endsWith(".gif");
}

bool assetUploadContentLengthWouldExceedLimits(const HTTPUpload& upload) {
  if (!assetPathLooksGif(assetUploadPath)) {
    return false;
  }
  return upload.contentLength > 0 && upload.contentLength > kMaxThemeGifAssetBytes;
}

bool assetUploadBytesWouldExceedLimits(size_t nextChunkSize) {
  if (!assetPathLooksGif(assetUploadPath)) {
    return false;
  }
  return assetUploadBytesSeen + nextChunkSize > kMaxThemeGifAssetBytes;
}

void enterAssetUploadSafeMode() {
  firmwareUpdateNoticeDirty = false;
  frameStaleStatusRendered = false;
  renderer.ResetGifStateForAssetUpdate();
  close_all_fs();
  WiFiUDP::stopAll();
  WiFi.setSleepMode(WIFI_NONE_SLEEP);
  ESP.wdtFeed();
}

void handleAssetUpload() {
  HTTPUpload& upload = webServer.upload();

  if (upload.status == UPLOAD_FILE_START) {
    assetUploadSucceeded = false;
    assetUploadInProgress = true;
    assetUploadError = "";
    assetUploadPath = requestedAssetPath();
    assetUploadBytesSeen = 0;
    Serial.printf("asset_upload_start path=%s filename=%s content_length=%zu\n", assetUploadPath.c_str(), upload.filename.c_str(), upload.contentLength);

    if (!requestHasValidAuth()) {
      setAssetUploadError("unauthorized");
      return;
    }
    if (!isMutableThemeAssetPath(assetUploadPath)) {
      setAssetUploadError("invalid asset path");
      return;
    }
    if (assetUploadContentLengthWouldExceedLimits(upload)) {
      setAssetUploadError("gif asset too large");
      return;
    }
    enterAssetUploadSafeMode();
    if (!LittleFS.begin()) {
      setAssetUploadError("filesystem mount failed");
      return;
    }
    if (!ensureAssetParentDirs(assetUploadPath)) {
      setAssetUploadError("create parent directory failed");
      return;
    }
    if (LittleFS.exists(kAssetUploadTemporaryPath) && !LittleFS.remove(kAssetUploadTemporaryPath)) {
      setAssetUploadError("remove stale upload failed");
      return;
    }
    assetUploadFile = LittleFS.open(kAssetUploadTemporaryPath, "w");
    if (!assetUploadFile) {
      setAssetUploadError("open asset failed");
      return;
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (assetUploadError.length() > 0) {
      return;
    }
    if (assetUploadBytesWouldExceedLimits(upload.currentSize)) {
      setAssetUploadError("gif asset too large");
      yield();
      return;
    }
    if (!assetUploadFile) {
      setAssetUploadError("append asset failed");
      return;
    }
    if (assetUploadFile.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setAssetUploadError("write asset failed");
    }
    assetUploadBytesSeen += upload.currentSize;
    ESP.wdtFeed();
  } else if (upload.status == UPLOAD_FILE_END) {
    if (assetUploadFile) {
      assetUploadFile.flush();
      assetUploadFile.close();
    }
    if (assetUploadError.length() == 0 &&
        validateCompletedAssetUpload() &&
        promoteCompletedAssetUpload()) {
      assetUploadSucceeded = true;
      Serial.printf("asset_upload_success path=%s bytes=%zu\n", assetUploadPath.c_str(), upload.totalSize);
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setAssetUploadError("upload aborted");
    finishAssetUploadRequest();
  }
  yield();
}

void handleAssetUploadResult() {
  if (assetUploadError == "unauthorized") {
    finishAssetUploadRequest();
    addCorsHeaders();
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
    return;
  }
  if (!assetUploadSucceeded || assetUploadError.length() > 0) {
    const String error = assetUploadError.length() > 0 ? assetUploadError : "upload failed";
    discardPartialAssetUpload();
    finishAssetUploadRequest();
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", error);
    return;
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(assetUploadPath);
  out += "\"}";
  finishAssetUploadRequest();
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void handleAssetDelete() {
  if (!requireWriteAuth()) {
    return;
  }
  String path = webServer.arg("path");
  path.trim();
  if (!isMutableThemeAssetPath(path)) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "invalid asset path");
    return;
  }
  if (!LittleFS.begin()) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "filesystem mount failed");
    return;
  }
  if (!LittleFS.exists(path)) {
    addCorsHeaders();
    webServer.send(404, "text/plain; charset=utf-8", "asset not found");
    return;
  }
  if (path == activeThemeSpecPath) {
    addCorsHeaders();
    webServer.send(409, "text/plain; charset=utf-8", "asset is active");
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  if (!LittleFS.remove(path)) {
    addCorsHeaders();
    webServer.send(500, "text/plain; charset=utf-8", "asset delete failed");
    return;
  }
  Serial.printf("asset_deleted path=%s\n", path.c_str());
  addCorsHeaders();
  webServer.send(200, "application/json", "{\"ok\":true}");
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool readActiveThemeSpecPath(String& path) {
  path = "";
  if (!LittleFS.begin() || !LittleFS.exists(kActiveThemeSpecPathFile)) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "r");
  if (!file) {
    return false;
  }
  path = file.readString();
  file.close();
  path.trim();
  return isSafeAssetPath(path) && path.startsWith("/themes/");
}

bool saveActiveThemeSpecPath(const String& path) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    return false;
  }
  if (!LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kActiveThemeSpecPathFile, "w");
  if (!file) {
    return false;
  }
  const size_t written = file.print(path);
  file.close();
  return written == path.length();
}

