DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void handleOtaResult(const char* target) {
  webServer.keepAlive(false);
  if (otaUploadError == "unauthorized") {
    otaUploadInProgress = false;
    otaDiagnostics.status = "failed";
    otaDiagnostics.lastError = otaUploadError;
    otaDiagnostics.updateError = Update.getError();
    otaDiagnostics.endedAtMs = millis();
    otaDiagnostics.failureCount++;
    otaUploadNeedsReboot = false;
    addCorsHeaders();
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
    return;
  }
  if (!otaUploadSucceeded || otaUploadError.length() > 0 || Update.hasError()) {
    otaUploadInProgress = false;
    const String error = otaUploadError.length() > 0 ? otaUploadError : Update.getErrorString();
    otaDiagnostics.status = "failed";
    otaDiagnostics.lastError = error;
    otaDiagnostics.updateError = Update.getError();
    otaDiagnostics.endedAtMs = millis();
    otaDiagnostics.failureCount++;
    Serial.printf("ota_upload_failed target=%s error=%s\n", target, error.c_str());
    webServer.send(500, "text/plain; charset=utf-8", "Update failed: " + error);
    if (otaUploadNeedsReboot) {
      scheduleReboot("ota_failure");
    }
    otaUploadNeedsReboot = false;
    return;
  }

  String html;
  html.reserve(500);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Update</title></head><body style='font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:32px'>";
  html += "<h1>Update successful</h1><p>";
  html += target;
  html += " was written. Vibe TV is restarting.</p></body></html>";
  webServer.send(200, "text/html; charset=utf-8", html);
  drawUpdateStatus("Restarting");
  waitStatusRendered = true;
  otaDiagnostics.status = "reboot_scheduled";
  scheduleReboot(target);
  otaUploadInProgress = false;
  otaUploadNeedsReboot = false;
}

void sendRawOtaResponse(WiFiClient& client, int status, const char* statusText, const String& body) {
  client.print("HTTP/1.1 ");
  client.print(status);
  client.print(" ");
  client.print(statusText);
  client.print("\r\nConnection: close\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Length: ");
  client.print(body.length());
  client.print("\r\n\r\n");
  client.print(body);
}

bool rawRequestLineIsFirmwarePost(const String& line) {
  return line.startsWith("POST /update/firmware.raw ") ||
         line.startsWith("POST /update/firmware.raw?") ||
         line.startsWith("PUT /update/firmware.raw ") ||
         line.startsWith("PUT /update/firmware.raw?");
}

String rawRequestToken(const String& line) {
  const int queryStart = line.indexOf("?token=");
  if (queryStart < 0) {
    return "";
  }
  int tokenStart = queryStart + 7;
  int tokenEnd = line.indexOf(' ', tokenStart);
  const int nextParam = line.indexOf('&', tokenStart);
  if (nextParam >= 0 && (tokenEnd < 0 || nextParam < tokenEnd)) {
    tokenEnd = nextParam;
  }
  if (tokenEnd < 0) {
    tokenEnd = line.length();
  }
  String token = line.substring(tokenStart, tokenEnd);
  token.trim();
  return token;
}

void handleRawOtaClient() {
  if (!rawOtaServerStarted || otaUploadInProgress || rebootPending) {
    return;
  }

  WiFiClient client = rawOtaServer.accept();
  if (!client) {
    return;
  }
  client.setTimeout(5000);

  String requestLine = client.readStringUntil('\n');
  requestLine.trim();
  if (!rawRequestLineIsFirmwarePost(requestLine)) {
    sendRawOtaResponse(client, 404, "Not Found", "not found");
    client.stop();
    return;
  }

  String rawToken = rawRequestToken(requestLine);
  size_t contentLength = 0;
  while (client.connected()) {
    String header = client.readStringUntil('\n');
    header.trim();
    if (header.length() == 0) {
      break;
    }
    String lower = header;
    lower.toLowerCase();
    if (lower.startsWith("content-length:")) {
      String value = header.substring(header.indexOf(':') + 1);
      value.trim();
      contentLength = static_cast<size_t>(value.toInt());
    } else if (lower.startsWith("x-vibetv-token:")) {
      rawToken = header.substring(header.indexOf(':') + 1);
      rawToken.trim();
    }
  }

  if (!codexbar_display::esp8266::WifiSecurityPolicy::AllowsFirmwareUpload(
          deviceAuthConfigured(),
          rawToken == deviceAuthToken)) {
    sendRawOtaResponse(client, 401, "Unauthorized", "pairing token required");
    client.stop();
    return;
  }

  if (contentLength == 0) {
    sendRawOtaResponse(client, 411, "Length Required", "content-length required");
    client.stop();
    return;
  }

  const size_t maxSize = otaMaxSizeForCommand(U_FLASH);
  if (contentLength > maxSize) {
    sendRawOtaResponse(client, 413, "Payload Too Large", "firmware image is too large");
    client.stop();
    return;
  }

  otaUploadSucceeded = false;
  otaUploadInProgress = true;
  otaUploadNeedsReboot = false;
  otaUploadError = "";
  otaDiagnostics.target = "firmware_raw";
  otaDiagnostics.status = "starting";
  otaDiagnostics.filename = "raw";
  otaDiagnostics.lastError = "";
  otaDiagnostics.command = U_FLASH;
  otaDiagnostics.contentLength = contentLength;
  otaDiagnostics.totalSize = 0;
  otaDiagnostics.maxSize = maxSize;
  otaDiagnostics.freeSketchSpace = ESP.getFreeSketchSpace();
  otaDiagnostics.updateError = UPDATE_ERROR_OK;
  otaDiagnostics.startedAtMs = millis();
  otaDiagnostics.endedAtMs = 0;

  enterOtaSafeMode(U_FLASH, &client);
  otaUploadNeedsReboot = true;
  drawUpdateStatus("Loading firmware");
  waitStatusRendered = true;

  if (!Update.begin(contentLength, U_FLASH)) {
    setOtaError(Update.getErrorString());
    resetOtaUpdaterAfterFailure();
  } else {
    otaDiagnostics.status = "writing";
  }

  uint8_t buffer[kRawOtaReadBufferBytes];
  size_t remaining = contentLength;
  unsigned long lastProgressMs = millis();
  while (remaining > 0 && otaUploadError.length() == 0) {
    const int available = client.available();
    if (available <= 0) {
      if (!client.connected()) {
        setOtaError("raw upload disconnected");
        resetOtaUpdaterAfterFailure();
        break;
      }
      if (millis() - lastProgressMs > kRawOtaProgressTimeoutMs) {
        setOtaError("raw upload timeout");
        resetOtaUpdaterAfterFailure();
        break;
      }
      delay(1);
      continue;
    }
    size_t want = static_cast<size_t>(available);
    if (want > remaining) {
      want = remaining;
    }
    if (want > sizeof(buffer)) {
      want = sizeof(buffer);
    }
    const int readCount = client.read(buffer, want);
    if (readCount <= 0) {
      delay(1);
      continue;
    }
    const size_t got = static_cast<size_t>(readCount);
    lastProgressMs = millis();
    remaining -= got;
    otaDiagnostics.totalSize += got;
    if (Update.write(buffer, got) != got) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
      break;
    }
    ESP.wdtFeed();
    delay(0);
  }

